src/DataProcessors/РегистрацияПрограммногоПродукта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>РегистрацияПрограммногоПродукта</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольПользователя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПользовательИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/РегистрацияПрограммногоПродукта/Forms/ФормаАнкеты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущаяСтраница = Неопределено;
	Параметры.Свойство("ТекущаяСтраница",ТекущаяСтраница);
	ОткрытьСтраницуВхода = ТекущаяСтраница = "Страницавхода";
	// Получить ранее сохраненную анкету
	АнкетаСруктураДанных = Обработки.РегистрацияПрограммногоПродукта.ПолучитьДанныеРегистрационнойАнкеты();
	Если АнкетаСруктураДанных <> Неопределено Тогда
		АнкетаСруктураДанных.Свойство("ОрганизацияНаименование"      ,ОрганизацияНаименование);
        АнкетаСруктураДанных.Свойство("ОрганизацииАдрес"             ,ОрганизацииАдрес);
		АнкетаСруктураДанных.Свойство("ОрганизацияТелефон"           ,ОрганизацияТелефон);
		АнкетаСруктураДанных.Свойство("ОрганизацияПочта"             ,ОрганизацияПочта);
		АнкетаСруктураДанных.Свойство("ПроудктРегистрационныйНомер"  ,ПроудктРегистрационныйНомер);
		АнкетаСруктураДанных.Свойство("ПродуктДатаПриобретения"      ,ПродуктДатаПриобретения);
		АнкетаСруктураДанных.Свойство("ПродуктГдеПриобреталось"      ,ПродуктГдеПриобреталось);
		АнкетаСруктураДанных.Свойство("ДвоичныеДанныеФайлаАнкеты"    ,ДвоичныеДанныеФайлаАнкеты);
        АнкетаСруктураДанных.Свойство("АнкетаПодтверждена"           ,АнкетаПодтверждена);
        АнкетаСруктураДанных.Свойство("АнкетаЗарегистрирована"       ,АнкетаЗарегистрирована);
        АнкетаСруктураДанных.Свойство("АнкетаСтатус"                 ,АнкетаСтатус);
		АнкетаСруктураДанных.Свойство("АнкетаСтатусПодробно"         ,АнкетаСтатусПодробно); 
		АнкетаСруктураДанных.Свойство("АнкетаДатаОкончанияПоддержки" ,АнкетаДатаОкончанияПоддержки);
        АнкетаСруктураДанных.Свойство("АнкетаСостояниеПоддержки"     ,АнкетаСостояниеПоддержки);
		АнкетаСруктураДанных.Свойство("АнкетаПоследнийКодСостояния"  ,АнкетаПоследнийКодСостояния);  
		АнкетаСруктураДанных.Свойство("АнкетаПарольВосстановления"   ,АнкетаПарольВосстановления); 
		ИдентификаторПользователя = Неопределено;
        АнкетаСруктураДанных.Свойство("АнкетаОтправитель"            ,ИдентификаторПользователя);
		Если ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
			АнкетаОтправитель = Справочники.Пользователи.ПолучитьСсылку(ИдентификаторПользователя)
		КонецЕсли;
		АнкетаПарольВосстановленияПовторно = АнкетаПарольВосстановления;
	КонецЕсли;	
	АнкетаЗарегистрированаПред = АнкетаЗарегистрирована;
	УстановитьСостояниеЭлементовФормы("ПриСозданииНаСервере",ОткрытьСтраницуВхода);
КонецПроцедуры

&НаКлиенте
// Перед закрытием формы на клиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если АнкетаЗарегистрирована <> АнкетаЗарегистрированаПред Тогда
		Оповестить("ИЗМЕНЕН_СТАТУС_РЕГИСТРАЦИОННОЙ_АНКЕТЫ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Установка состояния элементов формы
Процедура УстановитьСостояниеЭлементовФормы(Режим = Неопределено,ОткрытьСтраницуВхода = Неопределено)	
	Если Режим = "ПриСозданииНаСервере" Тогда
		Если ОткрытьСтраницуВхода = Истина Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаАвторизация;
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаРегистрация;
		КонецЕсли;	
	КонецЕсли;
	// Установить видимость группы управления отложенным напоминанием
	Элементы.НапомнитьпохжеОРегистрации.Доступность = АнкетаСруктураДанных = Неопределено ИЛИ НЕ АнкетаСруктураДанных.АнкетаЗарегистрирована;
	// Установить кратинку анкеты
	Если ДвоичныеДанныеФайлаАнкеты <> Неопределено Тогда
		АнкетаКартинка = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайлаАнкеты,ЭтаФорма.УникальныйИдентификатор);
	Иначе
		АнкетаКартинка = Неопределено;
	КонецЕсли;
	Элементы.ГруппаОсновная.ТолькоПросмотр                = АнкетаПодтверждена;
	Элементы.ЗарегистрироватьДляПодтверждения.Доступность = НЕ АнкетаПодтверждена;
	Элементы.ГруппаРегистрацияСуществует.Видимость        = НЕ АнкетаПоследнийКодСостояния = 301 И НЕ АнкетаПоследнийКодСостояния = 303;
	Элементы.ГруппаКомментарий.Видимость                  = ЗначениеЗаполнено(АнкетаСтатусПодробно);
	Элементы.ГруппаСсылкаФайла.Доступность                = НЕ АнкетаПодтверждена;
	Если АнкетаПоследнийКодСостояния = 301 ИЛИ АнкетаПоследнийКодСостояния = 303 Тогда
		Элементы.АнкетаСтатус.ЦветТекста                            = WebЦвета.Зеленый;
		Элементы.ЗарегистрироватьДляПодтверждения.Видимость         = Ложь;
		Элементы.ЗакрытьФорму.Видимость                             = Истина;
		Элементы.ЗакрытьФорму.КнопкаПоУмолчанию                     = Истина;
	Иначе
		Элементы.АнкетаСтатус.ЦветТекста                            = WebЦвета.Красный;
		Элементы.ЗарегистрироватьДляПодтверждения.Видимость         = Истина;
		Элементы.ЗакрытьФорму.Видимость                             = Ложь;
		Элементы.ЗарегистрироватьДляПодтверждения.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Элементы.ЗарегистрироватьДляПодтверждения.Видимость = НЕ АнкетаПоследнийКодСостояния = 301 И НЕ АнкетаПоследнийКодСостояния = 303; 
	
КонецПроцедуры


/////// СТРАНИЦА АВТОРИЗАЦИЯ///////

#Область ОбработчикиКомандФормы

&НаКлиенте
// Восстановить доступ к анкете
Процедура ВыборСуществующаяАнкета(Команда)	
	Результат = ВосстановитьДанныеАнкеты(АвторизацияРегистрационныйНомер,АвторизацияПароль);
	Если Результат.КодСостояния = 401 И Результат.АнкетаДанные <> Неопределено Тогда
		АнкетаСруктураДанных               = Результат.АнкетаДанные;
		ОрганизацияНаименование            = Результат.АнкетаДанные.ОрганизацияНаименование;
		ОрганизацииАдрес                   = Результат.АнкетаДанные.ОрганизацииАдрес ;
		ОрганизацияТелефон 			       = Результат.АнкетаДанные.ОрганизацияТелефон ;
		ОрганизацияПочта                   = Результат.АнкетаДанные.ОрганизацияПочта;
		ПроудктРегистрационныйНомер        = Результат.АнкетаДанные.ПроудктРегистрационныйНомер;
		ПродуктДатаПриобретения            = Результат.АнкетаДанные.ПродуктДатаПриобретения;
		ПродуктГдеПриобреталось            = Результат.АнкетаДанные.ПродуктГдеПриобреталось;
		ДвоичныеДанныеФайлаАнкеты          = Результат.АнкетаДанные.ДвоичныеДанныеФайлаАнкеты;
		АнкетаЗарегистрирована             = Результат.АнкетаДанные.АнкетаЗарегистрирована;
		АнкетаПодтверждена                 = Результат.АнкетаДанные.АнкетаПодтверждена ;
		АнкетаОтправитель                  = ТекущийПользователь();
		АнкетаСтатус                       = Результат.АнкетаДанные.АнкетаСтатус;
		АнкетаСтатусПодробно               = Результат.АнкетаДанные.АнкетаСтатусПодробно;
		АнкетаДатаОкончанияПоддержки       = Результат.АнкетаДанные.АнкетаДатаОкончанияПоддержки;
		АнкетаСостояниеПоддержки           = Результат.АнкетаДанные.АнкетаСостояниеПоддержки ;
		АнкетаПоследнийКодСостояния        = Результат.АнкетаДанные.АнкетаПоследнийКодСостояния;
		АнкетаПарольВосстановления         = Результат.АнкетаДанные.АнкетаПарольВосстановления;	
		АнкетаПарольВосстановленияПовторно = АнкетаПарольВосстановления;
		УстановитьСостояниеЭлементовФормы("ПриСозданииНаСервере");
		ЗаписатьДанныеАнкеты();
	КонецЕсли;
    ФорматированноеПредупреждение(Результат.ПодробноеОписание);
КонецПроцедуры

#КонецОбласти

// Зарегистрировать новую анкету
&НаКлиенте
Процедура Декорация5Нажатие(Элемент)
	 Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаРегистрация;
КонецПроцедуры

/////// СТРАИНИЦА РЕГИСТРАЦИИ АНКЕТЫ///////

&НаКлиенте
// Переопределение системной процедуры предупреждение
Процедура ФорматированноеПредупреждение(ТексСообщения)
	  ПоказатьПредупреждение(,Новый ФорматированнаяСтрока(ТексСообщения,Новый Шрифт(,10,Ложь)));
КонецПроцедуры

&НаКлиенте
// Обработчик перетаскивания обэекта в область кратинки
Процедура АнкетаКартинкаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Файл") Тогда
		ИмяФайла               = ПараметрыПеретаскивания.Значение.ПолноеИмя;
		ДвоичныеДанныеФайлаАнкеты = Новый ДвоичныеДанные(ИмяФайла);
		Если ДвоичныеДанныеФайлаАнкеты.Размер() > 5242880 Тогда
			ДвоичныеДанныеФайлаАнкеты = Неопределено;
			ФорматированноеПредупреждение("Размер файла не должен превышать 5Мб!");
			Возврат;
		КонецЕсли;	
		АнкетаКартинка         = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайлаАнкеты,ЭтаФорма.УникальныйИдентификатор);
		Элементы.ДекорацияФайлАнкеты.Заголовок = Новый ФорматированнаяСтрока("Файл анкеты: ",Новый ФорматированнаяСтрока(ИмяФайла,,,,ИмяФайла));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Обработчик проверки перетаскивания в область картинки
Процедура АнкетаКартинкаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки регистрации анкеты
Процедура ЗарегистрироватьДляПодтверждения(Команда)	
	
	Если АнкетаЗарегистрирована И АнкетаПоследнийКодСостояния = 301 Тогда
		ФорматированноеПредупреждение("Анкета зарегистрирована и находится на проверке. В данный момент повторная отправка данных невозможна.");
		Возврат;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ОрганизацияНаименование) Тогда
		ФорматированноеПредупреждение("Укажите наименование организации!");
		Возврат; 
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПроудктРегистрационныйНомер) Тогда
		ФорматированноеПредупреждение("Укажите регистрационный номер!");
		Возврат; 
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПродуктДатаПриобретения) Тогда
		ФорматированноеПредупреждение("Укажите дату приобретения продукта!");
		Возврат; 
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ОрганизацияТелефон) Тогда
		ФорматированноеПредупреждение("Укажите контактный телефон!");
		Возврат; 
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ОрганизацияПочта) Тогда
		ФорматированноеПредупреждение("Укажите контактный Mail!");
		Возврат; 
	КонецЕсли;
	Если ДвоичныеДанныеФайлаАнкеты = Неопределено Тогда
		ФорматированноеПредупреждение("Укажите файл анкеты!");
		Возврат; 
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(АнкетаПарольВосстановления) Тогда
		ФорматированноеПредупреждение("Укажите пароль восстановления доступа регистрационной анкеты!");
		Возврат; 
	ИначеЕсли АнкетаПарольВосстановления <> АнкетаПарольВосстановленияПовторно Тогда
		ФорматированноеПредупреждение("Пароль восстановления не совпадает с повторением пароля!");
		Возврат; 
	КонецЕсли;

	ПараметрыРегистрации                            = ПолучитьПустуюСтруктуруДанныхРегистрацииАнкеты();
	ПараметрыРегистрации.OrganizationName           = ОрганизацияНаименование;
	ПараметрыРегистрации.OrganizationAddress        = ОрганизацииАдрес;
	ПараметрыРегистрации.OrganizationPhone          = ОрганизацияТелефон;
	ПараметрыРегистрации.OrganizationMail           = ОрганизацияПочта;
	ПараметрыРегистрации.ProductRegistrationNumber  = ПроудктРегистрационныйНомер;
	ПараметрыРегистрации.ProductPurchaseDate        = ПродуктДатаПриобретения;
	ПараметрыРегистрации.ProductPurchasePlace       = ПродуктГдеПриобреталось;
	ПараметрыРегистрации.ProductProfilePicture      = ДвоичныеДанныеФайлаАнкеты;
	ПараметрыРегистрации.PasswordRecovety           = АнкетаПарольВосстановления;
	
	ОписаниеРезультатаОперции = Неопределено;
	РезОперции                = ЗарегистрироватьАнкетуПродукта(ПараметрыРегистрации,ОписаниеРезультатаОперции);	
	Сообщение                 = Неопределено;
	Если ЗначениеЗаполнено(ОписаниеРезультатаОперции) Тогда
		АнкетаЗарегистрирована      = ОписаниеРезультатаОперции.КодСостояния = 301;
		АнкетаПоследнийКодСостояния = ОписаниеРезультатаОперции.КодСостояния;
		АнкетаСтатусПодробно        = ОписаниеРезультатаОперции.ПодробноеОписание;
		АнкетаПоследнийКодСостояния = ОписаниеРезультатаОперции.КодСостояния;
		Если АнкетаЗарегистрирована Тогда
			АнкетаСтатус      = ОписаниеРезультатаОперции.АнкетаСтатус;
			АнкетаОтправитель = ТекущийПользователь();
			Сообщение = "Анкета принята для регистрации, о результатах Вы будете оповещены автоматически.";
		    // Записать данные анкеты и результат регистрации
	        ЗаписатьДанныеАнкеты();
		Иначе
			Сообщение = ОписаниеРезультатаОперции.ПодробноеОписание;
		КонецЕсли;	
	КонецЕсли;
	// Устанвоить состояние формы
	УстановитьСостояниеЭлементовФормы();
	Если Сообщение <> Неопределено Тогда
	    ФорматированноеПредупреждение(Сообщение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Выбрать файл через диалог
Процедура ДекорацияФайлАнкетыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	ТекущийЭлемент = Элементы.АнкетаКартинка;
	СтандартнаяОбработка = Ложь;
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.ПолноеИмяФайла = ?(НавигационнаяСсылка <> "выберите файл", НавигационнаяСсылка,"");
	ДиалогВыбора.Фильтр = "(*.bmp;*.jpg;*.jpeg;*.png)|*.bmp;*.jpg;*.jpeg;*.png";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Показать(Новый ОписаниеОповещения("ДекорацияФайлАнкетыОбработкаНавигационнойСсылкиЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбора", ДиалогВыбора)));
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация файл анкеты обработка навигационной ссылки завершение
//
// Параметры:
//  ВыбранныеФайлы			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ДекорацияФайлАнкетыОбработкаНавигационнойСсылкиЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбора = ДополнительныеПараметры.ДиалогВыбора;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ДвоичныеДанныеФайлаАнкеты = Новый ДвоичныеДанные(ДиалогВыбора.ПолноеИмяФайла);
		Если ДвоичныеДанныеФайлаАнкеты.Размер() > 5242880 Тогда
			ДвоичныеДанныеФайлаАнкеты = Неопределено;
			ФорматированноеПредупреждение("Размер файла не должен превышать 5Мб!");
			Возврат;
		КонецЕсли;	
		АнкетаКартинка                         = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайлаАнкеты,ЭтаФорма.УникальныйИдентификатор);
		Элементы.ДекорацияФайлАнкеты.Заголовок = Новый ФорматированнаяСтрока("Файл анкеты: ",Новый ФорматированнаяСтрока(ДиалогВыбора.ПолноеИмяФайла,,,,ДиалогВыбора.ПолноеИмяФайла));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик кнопки очистки картинки
Процедура ОчиститьКартинку(Команда)
	 АнкетаКартинка = Неопределено;
	 ДвоичныеДанныеКартинки = Неопределено;
	 Элементы.ДекорацияФайлАнкеты.Заголовок = Новый ФорматированнаяСтрока("Файл анкеты: ",Новый ФорматированнаяСтрока("выберите файл",,,,"выберите файл"));	
КонецПроцедуры

&НаСервере
// Записать данные анкеты и дополнительные парамтеры в константу
Процедура ЗаписатьДанныеАнкеты()
	
	ДанныеАнкеты = Обработки.РегистрацияПрограммногоПродукта.ПолучитьПустуюСтруктуруДанныхАнкетыДляХраненияНаКлиенте(); 	
	ДанныеАнкеты.ОрганизацияНаименование        = ОрганизацияНаименование;
	ДанныеАнкеты.ОрганизацииАдрес               = ОрганизацииАдрес;
	ДанныеАнкеты.ОрганизацияТелефон             = ОрганизацияТелефон;
    ДанныеАнкеты.ОрганизацияПочта               = ОрганизацияПочта;
    ДанныеАнкеты.ПроудктРегистрационныйНомер    = ПроудктРегистрационныйНомер;
	ДанныеАнкеты.ПродуктДатаПриобретения        = ПродуктДатаПриобретения;
	ДанныеАнкеты.ПродуктГдеПриобреталось        = ПродуктГдеПриобреталось;
	ДанныеАнкеты.ДвоичныеДанныеФайлаАнкеты      = ДвоичныеДанныеФайлаАнкеты;
	ДанныеАнкеты.АнкетаЗарегистрирована         = АнкетаЗарегистрирована;
    ДанныеАнкеты.АнкетаПодтверждена             = АнкетаПодтверждена;
	ДанныеАнкеты.АнкетаОтправитель              = АнкетаОтправитель.УникальныйИдентификатор();
	ДанныеАнкеты.АнкетаСтатус                   = АнкетаСтатус;
	ДанныеАнкеты.АнкетаСтатусПодробно           = АнкетаСтатусПодробно;
	ДанныеАнкеты.АнкетаДатаОкончанияПоддержки   = АнкетаДатаОкончанияПоддержки;
	ДанныеАнкеты.АнкетаСостояниеПоддержки       = АнкетаСостояниеПоддержки;
	ДанныеАнкеты.АнкетаПоследнийКодСостояния    = АнкетаПоследнийКодСостояния;
    ДанныеАнкеты.АнкетаПарольВосстановления     = АнкетаПарольВосстановления;

	Обработки.РегистрацияПрограммногоПродукта.ЗаписатьДанныеРегистрационнойАнкеты(ДанныеАнкеты);	
КонецПроцедуры

&НаКлиенте
// Открыть первую страницу
Процедура НапомнитьПозже(Команда)
	НапомнитьПозжеНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
// Напомнить о ргеистрации через неделю. Серверный вызов.
Процедура НапомнитьПозжеНаСервере()
	Константы.РегистрацияПрограммногоПродуктаДатаСледующегоНапоминания.Установить(НачалоДня(ТекущаяДата()) +(86400 * 7)); 
КонецПроцедуры

&НаКлиенте
// Напомнить о ргеистрации через неделю
Процедура ДекорацияРегистрацияСуществует(Элемент)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаАвторизация;
КонецПроцедуры




///////// ОБЕРТКИ/////////

&НаСервереБезКонтекста
// Серверная оберта функции регистрации новой анкеты
Функция ЗарегистрироватьАнкетуПродукта(ПараметрыРегистрации,ОписаниеРезультатаОперции)
	Возврат Обработки.РегистрацияПрограммногоПродукта.ЗарегистрироватьАнкетуПродукта(ПараметрыРегистрации,ОписаниеРезультатаОперции);
КонецФункции

&НаСервереБезКонтекста
// Серверная оберта функции регистрации новой анкеты
Функция ВосстановитьДанныеАнкеты(РегистрационныйНомер,ПарольВосстанвовления)
	Возврат Обработки.РегистрацияПрограммногоПродукта.ВосстановитьДанныеАнкетыПродукта(РегистрационныйНомер,ПарольВосстанвовления);
КонецФункции

&НаСервереБезКонтекста
// Серверная оберта функции получения пустой структуры данных регистрации новой анкеты
Функция ПолучитьПустуюСтруктуруДанныхРегистрацииАнкеты()
	Возврат Обработки.РегистрацияПрограммногоПродукта.ПолучитьПустуюСтруктуруДанныхРегистрацииАнкеты();
КонецФункции

&НаСервереБезКонтекста
// Получить текущего пользователя
Функция ТекущийПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь;	
КонецФункции

#КонецОбласти
